WIP: Updating the core architecture documentation
