--- a/documents/architecture/Network_Architecture.md
+++ b/documents/architecture/Network_Architecture.md
@@ -29,42 +30,93 @@ This graph show the primary data message flow in the network.
 
 ```graphviz
 digraph Message_flow {
-rankdir=UD;
   compound=true;
   labelangle=35;
   node [style=filled]
   node [ shape = "rect"];
   DART [shape = cylinder];
-  TLS [ style=filled fillcolor=green ];
+  Input [ label="Input\nValidator" style=filled fillcolor=green ]
   P2P [ style=filled fillcolor=red]
-  ContractInterface [ label="Contract\nInterface"]
+  ContractVerifier [ label="Contract\nVerifier"]
   NodeInterface [ label="Node\nInterface"]
   Transcript [shape = note]
   EpochCreator [label="Epoch\nCreator"]
-  subgraph cluster_1 {
-    peripheries=0;
-    TLS -> ContractInterface [label="HiRPC(contract)" color=green];
- 	ContractInterface -> Collector [label=contract color=green];
-	Collector -> TVM [label="contract-S" color=green];
-	EpochCreator -> Collector [label=contract color=darkgreen];
-	EpochCreator -> Transcript [label=epoch color=green];
-    TVM -> Transcript [label="archives\nin/out" color=red];
-  };
- subgraph cluster_2 {
-    peripheries=0;
-	TVM -> EpochCreator [label="contract-SC" color=green];
-    DART -> Replicator [label=recorder color=red dir=both];
-  };
-  subgraph cluster_3 {
-    peripheries=0;
-	DART -> NodeInterface [label="DART(ro)\nrecorder" dir=both color=magenta];
-    NodeInterface -> P2P [label=Document dir=both];
-  };
-  DART -> Collector [label=recorder color=red];
-  EpochCreator -> NodeInterface [label=gossip dir=both color=cyan4];
@@
   Transcript -> DART [label=recorder color=blue];
   Replicator -> NodeInterface [label=recorder];
 }
@@
+      linkStyle 4 stroke:green
+```
+
+```mermaid
+stateDiagram-v2
+    direction LR
+    Contract: Contract\nInterface
+    NodeInterface: Node\nInterface
+    Epoch: Epoch\nCreate
+    style Epoch fill:#00758f
+    [*] --> TLS : HiRPC
+      TLS --> Contract: contract
+      Contract --> Collector : contract 
+      Collector --> TVM : contract-S
+      TVM --> Epoch : contract-SC
+      Epoch --> Transcript : epoch 
+      Transcript --> DART : recorder
+      DART --> Collector : recorder(ro)
+      DART --> Replicator : recorder
+      Replicator --> DART : recorder
+      Replicator --> NodeInterface : recorder
+      DART --> NodeInterface : recorder(ro)
+      Epoch --> NodeInterface : wavefront
+      Epoch --> Collector : contract
+      NodeInterface --> DART : crud(ro) 
+      NodeInterface --> Epoch : wavefront 
+      NodeInterface --> P2P
+      P2P --> NodeInterface
 ```
 
 ## Tagion Service Hierarchy
